[
    {
        "title": "A Sample of TARDIS Improvements at TARDISCon",
        "author_id": "",
        "article_id": "sample_tardis_improvements_obrien",
        "display": true,
        "date": "19th Jul, 2024",
        "category": "News or research",
        "tags": [
            "TARDISCon",
            "TARDIS",
            "news",
            "supernova"
        ],
        "platforms": [
            "tardis"
        ],
        "short_description": "At TARDISCon, we developed two new sampling methods for different scenarios: the decay of positronium and the emission of packets from the photosphere.",
        "long_description": "",
        "cover_image_height": "520px",
        "cover_image_width": "330px",
        "cover_image": "../articles/samplers_compare.mp4",
        "content": {
            "1_para": "At TARDISCon, part of the TARDIS team (Anirban Dutta, Jing Lu, and Jack O’Brien) worked on a new positronium spectrum sampler. Positronium is a bound system of an electron and a positron that is stable for only a very short time (nanoseconds). It has a chance to be formed as part of the beta decay process of radioactive elements in supernovae. When the electron-positron pair annihilate each other, they can produce either 2 or 3 gamma-rays. We wrote code to sample the possible gamma-ray energies by inverting the integral description from Ore & Powell (1949).",
            "2_para": "This sampler will be used as part of the gamma-ray energy deposition module for TARDIS that is currently under development. It will enable TARDIS to accurately simulate the formation and annihilation of positronium and the resulting gamma-ray spectra and deposition rates.",
            "3_para": "In addition to adding samplers for new physics processes, TARDIS team members added new sampling features to the existing radiative transfer framework.  Jack O'Brien, Anirban Dutta, and Wolfgang Kerzendorf wrote a weighted sampler implementation for the Monte Carlo packet instantiation.  This new sampler allows TARDIS to draw more packet samples in wavelength regions with low radiative intensity to improve the quality of the statistics, especially near the red and blue ends of the spectrum.  In contrast to the original packet sampler, which generates packets at each frequency with a probability corresponding to its initial radiative intensity, the weighted sampler works by drawing frequencies for each packet uniformly across the spectrum and assigning a weight to each packet based on the initial radiative intensity.  In the future, this sampler will serve to help TARDIS both track and actively improve its sampling efficiency in undersampled regions of the spectrum as well as serve as a base for more complex importance samplers.",
            "4_img": "../articles/samplers_compare.mp4"
        },
        "people_involved_ids": [
            "",
            "",
            "",
            ""
        ],
        "links": {},
        "twitter": "None"
    },
    {
        "title": "Introducing a new logger widget for TARDIS!",
        "author_id": "",
        "article_id": "logger_widget_2024",
        "display": true,
        "date": "19th Jul, 2024",
        "category": "News",
        "tags": [
            "logging",
            "simulation"
        ],
        "platforms": [
            "tardis"
        ],
        "short_description": "Detailed logger for TARDIS simulation run",
        "long_description": "",
        "cover_image_height": "520px",
        "cover_image_width": "330px",
        "cover_image": "../images/logger.gif",
        "content": {
            "1_para": "During TARDIS Con 2024, a collaborative effort by Deeksha, Jaladh, Jing, and Anirban led to the development of a logging widget for TARDIS simulation runs. This widget organizes logging information into four tabs with the categories: warnings and errors, detailed simulation run information (including convergence and iteration details), debugging logs, and a comprehensive tab that consolidates all logs in the order they occur.",
            "2_para": "The new logging widget enhances the user experience by providing a clear overview of the simulation's performance and potential issues."
        },
        "people_involved_ids": [
            "",
            "",
            ""
        ],
        "links": {},
        "twitter": "None"
    },
    {
        "title": "TARDIS-con",
        "author_id": "",
        "article_id": "tardis-con24",
        "display": true,
        "date": "19th Jul, 2024",
        "category": "News",
        "tags": [
            "news"
        ],
        "platforms": [
            "tardis"
        ],
        "short_description": "",
        "long_description": "",
        "cover_image": "website_files/images/article_content/TARDIScon24-Plasma-Session.jpg",
        "content": {
            "1_para": "TARDIS-Con 2024 has come and gone. After another unique two-week un-conference, we are exhausted but very proud of the many projects that we worked on. ",
            "2_img": "TARDIScon24-Plasma-triangle.jpg",
            "3_para": "On the TARDIS side, we worked on improving the code's efficiency, implementing new features, and discussing the latest scientific insights related to supernovae.",
            "4_para": "Our insights into Science of Science grew rapidly. We looked at how international collaborations become more prevalent in the last decades. ",
            "5_para": "We also enjoyed some group outings, including a day trip to Ann Arbor for a local craft market and a detour through an escape room.",
            "6_img": "../articles/TARDIScon24-Group-outing.jpg",
            "7_para": "See you next year at TARDIS-Con 2025!"
        },
        "people_involved_ids": [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        "links": {},
        "twitter": "None"
    },
    {
        "title": "Attention: Update your TARDIS Python environment",
        "author_id": "",
        "article_id": "update_python_env_2024",
        "display": true,
        "date": "10th Jun, 2024",
        "category": "Updates",
        "tags": [
            "updates",
            "dependencies"
        ],
        "platforms": [
            "tardis"
        ],
        "short_description": "We've updated our Python environment with the latest dependencies. Please update your environment to stay in sync and ensure optimal performance.",
        "long_description": "",
        "cover_image": "../articles/lock_file_update_2024.jpeg",
        "content": {
            "1_para": "We upgrade the TARDIS environment with the current version of the scientific python software stack. This is to ensure that we include the latest bug fixes in our dependencies and have access to new API and tools.  We have updated our Python environment with the latest dependencies and the current lock-file is available here. Please read here how to <a href='https://tardis-sn.github.io/tardis/installation.html#environment-update'>update</a> the new environment."
        },
        "people_involved_ids": [
            ""
        ],
        "links": {},
        "twitter": "None"
    },
    {
        "title": "GSoC Students Begin Projects to Enhance TARDIS",
        "author_id": "",
        "article_id": "gsoc_students_2024_begin",
        "display": true,
        "date": "27th May, 2024",
        "category": "News",
        "tags": [
            "news"
        ],
        "platforms": [
            "tardis"
        ],
        "short_description": "",
        "long_description": "",
        "cover_image": "website_files/images/article_content/gsoc_plus_tardis.png",
        "content": {
            "1_para": "We are thrilled to announce that our Google Summer of Code (GSoC) students, Sumit Gupta, Ashish Kumar, and Sarthak Srivastava, have officially started their projects! The projects will improve TARDIS performance, add tools for better analysis of the simulation and code to improve its science capabilities."
        },
        "people_involved_ids": [],
        "links": {},
        "twitter": "None"
    },
    {
        "title": "A Dr. is Born - Josh Shields Defends Thesis on SN Ia Surviving Companions",
        "author_id": "",
        "article_id": "thesis_defense_josh",
        "display": true,
        "date": "03th May, 2024",
        "category": "News",
        "tags": [
            "news",
            "defense",
            "supernova",
            "Internship"
        ],
        "platforms": [
            "tardis",
            "kg"
        ],
        "short_description": "We are pleased to announce that Josh has just defended his thesis at Michigan State University investigating the progenitors of Type Ia Supernovae through the study of their surviving companions. Josh performed multiple surviving companion investigations in supernova remnants, and adapted TARDIS to be able to model stellar atmospheres and produce surviving companion spectra. He will continue to work with us expanding the plasma physics of TARDIS. ",
        "long_description": "",
        "cover_image_height": "520px",
        "cover_image_width": "330px",
        "cover_image": "../articles/josh_defense_title_slide.jpg",
        "content": {
            "1_para": "On May 3rd of 2024, Joshua Shields successfully defended his thesis invesitgating the surviving companions of Type Ia Supernovae. He joined our group in 2019 and quickly became an expert in stellar modeling and radiative transfer. In his first project he investigated the SN 1006 remnant for hypervelocity white dwarfs, interesting peculiar stars that could might result from SN Ia. In his second project, he investigated the SNR 0509-67.5 remnant in the Large Magellanic Cloud, testing a large collection of SN Ia progenitor scenarios by modelling the spectral energy distributions of all the stars inside the remnant. He then developed the STARDIS code, an adaptation of TARDIS, able to model stellar atmospheres and produce spectra of surviving companions. He will continue working with us, improving the functionality of TARDIS. He is an integral part of our group, and we are ecstatic to see what he does next.",
            "2_img": "../articles/josh_defense_group_photo.jpg"
        },
        "people_involved_ids": [
            ""
        ],
        "links": {},
        "twitter": "None"
    },
    {
        "title": "Dr. Jack O'Brien Successfully Defends Thesis on Supernova Progenitor Identification",
        "author_id": "",
        "article_id": "thesis_defence_jack",
        "display": true,
        "date": "20th Apr, 2024",
        "category": "News",
        "tags": [
            "news",
            "Internship"
        ],
        "platforms": [
            "tardis",
            "kg"
        ],
        "short_description": "We congratulate Dr. Jack O’Brien for successfully defending his thesis titled “Progenitor Identification of Type Ia Supernovae through Statistical Abundance Tomography from Optical Spectra with Machine Learning and Radiative Transfer” in astrophysics at Michigan State University. Jack started with us in 2020 and scientifically worked on (in addition to his thesis work) adding continuum opacities to TARDIS. He became and still is our education coordinator and made sure that students from different disciplines received training in physics, computing, and machine learning. He will join Gautham Narayan’s group at University of Illinois, Urbana-Champaign in the Fall of 2024. Thank you for all of your contributions and help and for being a fantastic team member!",
        "long_description": "",
        "cover_image": "../articles/jackDefence.jpg",
        "content": {
            "1_para": "We congratulate Dr. Jack O’Brien for successfully defending his thesis titled “Progenitor Identification of Type Ia Supernovae through Statistical Abundance Tomography from Optical Spectra with Machine Learning and Radiative Transfer” in astrophysics at Michigan State University. Jack started with us in 2020 and scientifically worked on (in addition to his thesis work) adding continuum opacities to TARDIS. He became and still is our education coordinator and made sure that students from different disciplines received training in physics, computing, and machine learning. He will join <a href='https://gnarayan.github.io/'>Gautham Narayan's group</a> at University of Illinois, Urbana-Champaign in the Fall of 2024. Thank you for all of your contributions and help and for being a fantastic team member!"
        },
        "people_involved_ids": [
            ""
        ],
        "links": {
            "Gautham Narayan group": "https://gnarayan.github.io/"
        },
        "twitter": "None"
    },
    {
        "title": "Accepted as a mentoring organisation for Google Summer of Code 2024",
        "author_id": "",
        "article_id": "gsoc_2024_news",
        "display": true,
        "date": "29th Mar, 2024",
        "category": "News",
        "tags": [
            "news"
        ],
        "platforms": [
            "tardis"
        ],
        "short_description": "We are a part of Google Summer of Code 2024.",
        "long_description": "",
        "cover_image": "../articles/gsoc-logo-2024.png",
        "content": {
            "1_para": "We are excited to announce that TARDIS has been accepted as a mentoring organization in Google Summer of Code 2024! Check out our <a href='https://tardis-sn.github.io/summer_of_code/ideas/'>ideas page</a> and connect with us on <a href='https://gitter.im/tardis-sn/gsoc'>gitter</a> if you are interested! Please note that application deadline is April 2nd, 2024"
        },
        "people_involved_ids": [],
        "links": {
            "Our Gitter": "https://gitter.im/tardis-sn/gsoc",
            "GSoC Ideas": "https://tardis-sn.github.io/summer_of_code/ideas/"
        },
        "twitter": "None"
    }
]