[
    {
        "title": "Introducing STARDIS: An Open and Modular Stellar Spectral Synthesis Code",
        "author_id": "Josh Shields",
        "article_id": "stardis_release",
        "display": true,
        "date": "2025-08-28",
        "category": "News",
        "tags": [
            "paper",
            "Astrophysics",
            "Stellar Spectroscopy",
            "Software Release"
        ],
        "platforms": [
            "kg",
            "tardis"
        ],
        "short_description": "We introduce STARDIS, a new open-source Python stellar spectral synthesis code that performs 1D LTE radiative transfer for FGK stars from near-UV to IR wavelengths.",
        "cover_image_height": "330px",
        "cover_image_width": "520px",
        "cover_image": "../articles/halpha_sol.png",
        "content": {
            "1_para": "We are excited to announce the release of STARDIS, a new 1D stellar spectral synthesis Python code with a detailing manuscript published in The Astrophysical Journal. STARDIS is a modular, open-source radiative transfer code capable of spectral synthesis from near-UV to IR for FGK stars. Built on the TARDIS infrastructure and written in Python—one of the most used languages in astronomy—STARDIS is intended to be approachable for current and future astrophysicists.",
            "2_img": "../articles/stardis_diagram.jpeg",
            "3_para": "The code performs three major computational steps: solving the plasma state (molecular, ionization, and excitation balances), calculating wavelength-dependent opacities including continuum and line sources with sophisticated broadening treatments, and solving the radiative transfer equation through ray-tracing to produce synthetic stellar spectra. Validation against established codes like KORG shows excellent agreement, typically within 3% for most spectral features, making STARDIS a reliable tool for stellar abundance analysis and spectroscopic studies."
        },
        "people_involved_ids": [
            "Josh Shields",
            "Wolfgang Kerzendorf",
            "",
            "Andrew Fullard",
            "Jing Lu"
        ],
        "links": {
            "manuscript": "https://iopscience.iop.org/article/10.3847/1538-4357/adee11",
            "github": "https://github.com/tardis-sn/stardis",
            "documentation": "https://tardis-sn.github.io/stardis/",
            "doi": "10.3847/1538-4357/adee11"
        },
        "twitter": ""
    },
    {
        "title": "Deeksha Mohanty Defends Master's Thesis on Enhancing Convergence in TARDIS",
        "author_id": "",
        "article_id": "thesis_defense_deeksha",
        "display": true,
        "date": "2025-07-07",
        "category": "News",
        "tags": [
            "Master's Thesis",
            "talk"
        ],
        "platforms": [
            "kg",
            "tardis"
        ],
        "short_description": "Deeksha Mohanty successfully defended her master's thesis on adaptive damping and convergence in TARDIS simulations at Michigan State University.",
        "cover_image_height": "390px",
        "cover_image_width": "520px",
        "cover_image": "../articles/defense_before.jpeg",
        "content": {
            "1_para": "We congratulate [deeksha_mohanty] on successfully defending her master's thesis titled “Towards Faster Supernovae Simulations: Enhancing Convergence in TARDIS with Adaptive Damping” at Michigan State University. Her work focused on improving the convergence behavior of TARDIS by studying the stability of its fixed-point iteration scheme and introducing adaptive damping strategies to accelerate it. Deeksha began by developing a convergence framework to analyze and visualize iteration behavior across different supernova types and noise conditions. Building on this, she implemented adaptive damping techniques that respond to residual trends, with the goal of speeding up convergence while maintaining numerical stability.Her benchmarking efforts explored the effects of damping parameters, random seeds, and initial conditions on convergence across hundreds of simulations. We thank her for her contributions and wish her the best in her future endeavors.",
            "2_img": "research_news/articles/thesis_defense_deeksha/media/images/defense_after.jpeg"
        },
        "people_involved_ids": [
            ""
        ],
        "links": {},
        "twitter": "None"
    },
    {
        "title": "Introducing GSoC-2025 Contributor Riddhi Gangbhoj",
        "author_id": "",
        "article_id": "gsoc_introduction_riddhi",
        "display": true,
        "date": "2025-06-17",
        "category": "News",
        "tags": [
            "GSoC",
            "GSoC-2025",
            "Summer Program",
            "2025"
        ],
        "platforms": [
            "tardis"
        ],
        "short_description": "",
        "cover_image_height": "330px",
        "cover_image_width": "520px",
        "cover_image": "../articles/riddhigangbhoj.jpg",
        "content": {
            "1_para": "Riddhi Gangbhoj is one of the Google Summer of Code 2025 contributors. She is a software developer who completed her graduation in 2023 and worked with Accenture for a year before doing GSoC",
            "2_para": "As a GSoC contributor, she will work on building a regression data dashboard for TARDIS which will improve the testing experience. Her work will allow detailed comparison and visualization of regression data across TARDIS commits. Additionally, she will develop tools for detailed comparison of individual HDF files and numpy arrays."
        },
        "people_involved_ids": [],
        "links": {},
        "twitter": ""
    },
    {
        "title": "Introducing GSoC Contributor Haille Perkins",
        "author_id": "",
        "article_id": "gsoc_intro_perkins",
        "display": true,
        "date": "2025-06-05",
        "category": "News",
        "tags": [
            "GSoC",
            "Summer Program",
            "2025"
        ],
        "platforms": [
            "tardis"
        ],
        "short_description": "",
        "cover_image_height": "330px",
        "cover_image_width": "520px",
        "cover_image": "../articles/perkinsPhoto.jpeg",
        "content": {
            "1_para": "Haille Perkins is one of this year's Google Summer of Code contributors! She is a 3rd year graduate candidate in the Astronomy Department at the University of Illinois Urbana-Champaign. At UIUC, her these work focuses on modeling kilonovae and rare core collapse supernovae to learn more about the nucleosynthesis involved in these events. As a GSoC contributor, she will be working on functionality to indicate spectral line features in TARDIS spectral visualizations.  Her work will enable simple comparisons with published, labeled spectra; a physical understanding of new models; and development of publication-ready plots.  Additionally, she will utilize `jax` to more efficiently compute Lucy (1999b) formal integral spectra, reducing computational cost for users. "
        },
        "people_involved_ids": [],
        "links": {},
        "twitter": ""
    },
    {
        "title": "GSoC 2025 Coding Period Begins",
        "author_id": "",
        "article_id": "gsoc_participants_2025",
        "display": true,
        "date": "2025-06-02",
        "category": "News",
        "tags": [],
        "platforms": [
            "tardis"
        ],
        "short_description": "",
        "cover_image_height": "330px",
        "cover_image_width": "520px",
        "cover_image": "../articles/gsoc_2025_participants.png",
        "content": {
            "1_para": "Today marks the official start of the 2025 Google Summer of Code coding period for the TARDIS project. We are excited to welcome Haillie Perkins and Riddhi Gangbhoj as this year's GSoC participants.",
            "2_para": "Riddhi Gangbhoj will tackle the Regression Data Dashboard and HDF writing capabilities project, which would help in tracking changes in regression test outputs and enhancing HDF I/O.",
            "3_para": "Haillie Perkins will work on the implementing Line Identification Plotting Functionality to visualize the origins of spectral lines in TARDIS and STARDIS.",
            "4_para": "We are thrilled to have them on board and look forward to a productive summer of collaboration and innovation. Stay tuned for updates on their progress!"
        },
        "people_involved_ids": [],
        "links": {},
        "twitter": ""
    },
    {
        "title": "The TARDIS collaboration mourns the loss of R. Kurucz",
        "author_id": "Andrew Fullard",
        "article_id": "kurucz_obituary_andrew",
        "display": true,
        "date": "2025-03-05",
        "category": "News",
        "tags": [],
        "platforms": [
            "tardis",
            "kg"
        ],
        "short_description": "The TARDIS collaboration mourns the loss of R. Kurucz",
        "cover_image_height": "630px",
        "cover_image_width": "580px",
        "cover_image": "../articles/kurucz-spectrum.png",
        "content": {
            "1_para": "The TARDIS collaboration was saddened to learn of the passing of Robert Kurucz on March 1st, 2025. Much of the work we do has been based on his many years of careful work gathering and processing atomic data for astrophysics research. Our default atomic data file bears his name. We recommend reading his Boston Globe obituary at https://obits.mlive.com/us/obituaries/bostonglobe/name/robert-kurucz-obituary?id=57719179 and consider donating to UNICEF to honor his legacy."
        },
        "people_involved_ids": [],
        "links": {},
        "twitter": ""
    },
    {
        "title": "TARDIS Repository Hits 3000 Pull Requests!",
        "author_id": "Abhinav Ohri",
        "article_id": "3000_pull_requests_abhinav",
        "display": true,
        "date": "2025-03-03",
        "category": "News",
        "tags": [
            "TARDIS",
            "Milestone",
            "Open Source"
        ],
        "platforms": [
            "tardis"
        ],
        "short_description": "Celebrating a major milestone as the TARDIS repository reaches 3000 pull requests.",
        "cover_image_height": "330px",
        "cover_image_width": "520px",
        "cover_image": "../articles/cover.gif",
        "content": {
            "1_para": "We are thrilled to announce that on March 03, 2025 the <a href='https://github.com/tardis-sn/tardis'>TARDIS repository</a> has reached an incredible milestone of 3000 pull requests! This achievement is a testament to the hard work and dedication of our amazing community of contributors. Since its inception, TARDIS has grown exponentially, thanks to the continuous support and contributions from developers around the world. Each pull request represents a step forward in making TARDIS a more robust and feature-rich tool for everyone. We are excited to see what the future holds as we continue to innovate and improve. We extend our heartfelt gratitude to all contributors, past and present, for their invaluable efforts. Together, we are building something truly remarkable."
        },
        "people_involved_ids": [],
        "links": {
            "GitHub Repository": "https://github.com/tardis-sn/tardis",
            "Contribution Guide": "https://github.com/tardis-sn/tardis/blob/main/CONTRIBUTING.md"
        },
        "twitter": ""
    },
    {
        "title": "TARDIS Selected as a Google Summer of Code 2025 Mentoring Organization",
        "author_id": "",
        "article_id": "tardis_2025_gsoc",
        "display": true,
        "date": "2025-02-27",
        "category": "News",
        "tags": [
            "GSoC",
            "Summer Program",
            "2025"
        ],
        "platforms": [
            "tardis"
        ],
        "short_description": "",
        "cover_image_height": "330px",
        "cover_image_width": "520px",
        "cover_image": "../articles/gsoc_2025_mentoring.png",
        "content": {
            "1_para": "TARDIS has been selected as a mentoring organization for Google Summer of Code 2025. We’re thrilled to join this global program and provide guidance to aspiring open-source contributors and advancing open-source research in computational astrophysics.We look forward to a productive summer of collaboration and innovation."
        },
        "people_involved_ids": [],
        "links": {},
        "twitter": ""
    },
    {
        "title": "Modeling Stripped-Envelope Supernovae with Physics-Driven Framework",
        "author_id": "Jing Lu",
        "research_id": "",
        "article_id": "sesn_model_jing",
        "display": true,
        "date": "2025-01-13",
        "category": "News",
        "tags": [
            "paper",
            "Astrophysics"
        ],
        "platforms": [
            "kg",
            "tardis"
        ],
        "short_description": "",
        "cover_image_height": "330px",
        "cover_image_width": "520px",
        "cover_image": "../articles/sesn.jpeg",
        "content": {
            "1_para": "Stripped-envelope supernovae (SESNe) are the explosive deaths of massive stars that have lost their outer hydrogen and sometimes helium layers. These events are key for studying the final stages of stellar evolution, binary interactions, and stellar wind effects of massive stars. However, their origins and explosion mechanisms remain uncertain. [jing_lu] and her collaborators took part in tackling these challenges by studying the synthetic observables of a set of physics-driven explosions of massive stars that potentially lead to SESNe.",
            "2_para": "The study used radiative transfer simulations to model light curves and spectra of SESNe from massive Wolf-Rayet stars with ejecta masses of 4 to 11 solar masses. The results indicate that progenitors with higher ejecta masses produce broader light curves, consistent with some observed SESNe, but their peak luminosities are lower than expected. Methods commonly used to estimate ejecta mass based on radiative-powered light curves were shown to have uncertainties up to 160%, highlighting the need for self-consistent physics-based models. Additionally, the analysis found that helium lines are detectable even in models with very small helium masses, emphasizing the role of radiation field and ejecta composition in shaping spectral features.",
            "3_para": "This study provides a framework for better understanding SESNe and identifies areas for future improvement, including expanding progenitor model grids and enhancing the treatment of nuclear burning and mixing processes in the hydrodynamic simulations. This work provides a step forward for the direct linkage between the SESNe properties and their progenitor stars."
        },
        "people_involved_ids": [
            "Jing Lu"
        ],
        "links": {},
        "twitter": ""
    },
    {
        "title": "Transitioning from Black to Ruff",
        "author_id": "",
        "article_id": "black_to_ruff",
        "display": true,
        "date": "2024-11-01",
        "category": "News",
        "tags": [
            "news"
        ],
        "platforms": [
            "tardis"
        ],
        "short_description": "We have successfully transitioned from Black to Ruff.",
        "cover_image_height": "330px",
        "cover_image_width": "520px",
        "cover_image": "../articles/ruff.png",
        "content": {
            "1_para": "We have transitioned from Black to Ruff in our codebase, primarily due to Ruff's exceptional speed and efficiency. Ruff is over 30 times faster than Black, which significantly enhances our development workflow.Additionally, it maintains great compatibility with Black, allowing for a seamless integration."
        },
        "people_involved_ids": [],
        "links": {},
        "twitter": ""
    },
    {
        "title": "TARDIS attends the Google Summer of Code Mentor Summit",
        "author_id": "",
        "article_id": "tardis_attends_gsoc_summit",
        "display": true,
        "date": "2024-10-05",
        "category": "News",
        "tags": [
            "gsoc"
        ],
        "platforms": [
            "tardis"
        ],
        "short_description": "Wolfgang Kerzendorf and Andreas Flörs attended the Google Summer of Code (GSoC) mentor summit to represent the TARDIS collaboration. Andreas gave a lightning talk summarizing the TARDIS participation in GSoC, emphasizing the excellent work accomplished by the students. The summit provided an opportunity for meaningful discussions with other open-science-focused projects, and potential collaborations are now on the horizon.",
        "cover_image_height": "520px",
        "cover_image_width": "330px",
        "cover_image": "../articles/image2.png",
        "content": {
            "1_para": "[wolfgang_kerzendorf] and [andreas_flors] attended the Google Summer of Code (GSoC) mentor summit to represent the TARDIS collaboration. Andreas gave a lightning talk summarizing the TARDIS participation in GSoC, emphasizing the excellent work accomplished by the students. The summit provided an opportunity for meaningful discussions with other open-science-focused projects, and potential collaborations are now on the horizon."
        },
        "people_involved_ids": [],
        "links": {},
        "twitter": ""
    },
    {
        "title": "Enhancing Packet Trackers",
        "author_id": "Sumit Gupta",
        "article_id": "gsoc_2024_enhancing_packet_trackers_sumit",
        "display": true,
        "date": "2024-08-23",
        "category": "News",
        "tags": [
            "packet trackers"
        ],
        "platforms": [
            "tardis"
        ],
        "short_description": "This article covers all the cool stuff we've been up to this summer for the GSoC project related to packet trackers.",
        "cover_image_height": "520px",
        "cover_image_width": "330px",
        "cover_image": "../articles/cover_image_sharpened.png",
        "content": {
            "1_para": "We have introduced a new RPacketLastInteractionTracker class to keep track of the last interaction of a RPacket.",
            "2_img": "media/images/RPacketLastInteractionTracker.png",
            "3_para": "As a result of the tracker restructuring, the peak memory usage has been reduced from 4 GB to approximately 1 GB.",
            "4_para": "<strong>Before Restructure</strong>",
            "5_img": "media/images/beforeRestructure.png",
            "6_para": "<strong>After Restructure</strong>",
            "7_img": "media/images/afterRestructure.png",
            "8_para": "We also added detailed boundary interaction to the RPacketTracker, the structure of which looks like",
            "9_img": "media/images/boundary_interaction.png",
            "10_para": "`event_id` is the interaction number, `current_shell_id` is the previous boundary, and `next_shell_id` is the shell id to which the packet moved",
            "11_para": "We also researched a lot about Numba. Some of the things included using dynamic variables inside Numba using approaches like overload, branch pruning, etc., if you are interested about it, here are some <a href='https://gist.github.com/Sumit112192/6ddf8cb7be016caba1ce98feca95815d'>toy code.</a>",
            "12_para": "Also, we made sure to create lots of tests and benchmarks to ensure that the trackers are working at their best.",
            "13_para": "The detailed report for the GSoC project is available <a href='https://gist.github.com/Sumit112192/fc0140fa2d11bb903bd2d0e0ce0c8462'>here</a>."
        },
        "people_involved_ids": [],
        "links": {},
        "twitter": ""
    },
    {
        "title": "LIV (Last Interaction Velocity) Plot",
        "author_id": "Sarthak Srivastava",
        "article_id": "liv_plot_sarthak",
        "display": true,
        "date": "2024-08-23",
        "category": "News",
        "tags": [
            "visualization"
        ],
        "platforms": [
            "tardis"
        ],
        "short_description": "Hi, this article highlights the development of the LIV (Last Interaction Velocity) Plot during this summer's GSoC program—a new visualization tool that plots the last photon packet interactions by velocity for each element in supernova ejecta, offering deeper insights into supernova spectra.",
        "cover_image_height": "520px",
        "cover_image_width": "330px",
        "cover_image": "../articles/LIV_ply.png",
        "content": {
            "1_para": "The TARDIS SDEC plot visualizes which atoms photon packets interact with before they escape the ejecta and contribute to the output spectrum's absorption and emission features. However, the SDEC plot does not visualize where these interactions occur within the ejecta. This information can be beneficial to astronomers who want to understand which regions of the ejecta are responsible for important features in the output spectrum.",
            "2_para": "This project develops the LIV (Last Interaction Velocity) Plot that plots the number of photon packet interactions as a velocity function for each element present in the ejecta. One such example is shown in the plot below.",
            "3_img": "research_news/articles/LIV_Plot_Sarthak/media/images/LIV_mpl.png",
            "4_para": "We can create a highly informative and visually appealing Last Interaction Velocity plot using Matplotlib, If you're using the Last Interaction Velocity plot for exploration, consider creating an interactive version with Plotly. This allows you to zoom, pan, and inspect data values by hovering, resizing the scale, and more conveniently.",
            "5_img": "research_news/articles/LIV_Plot_Sarthak/media/images/plotly-gif.gif",
            "6_para": "The plots have various options providing the users with more control over how your last interaction velocity looks, like, 'species_list', 'nelements', 'packet_wvl_range', 'num_bins', 'log_scale' and many other options.",
            "7_para": "The detailed report for the GSoC project is available <a href='https://sites.google.com/view/sarthak-gsoc2024/home'>here</a>."
        },
        "people_involved_ids": [
            "Sarthak Srivastava",
            "James Gillanders",
            "Jaladh Singhal",
            "Abhinav Ohri",
            "Mark Magee"
        ],
        "links": {
            "Full Report": "https://sites.google.com/view/sarthak-gsoc2024/home"
        },
        "twitter": ""
    },
    {
        "title": "A Sample of TARDIS Improvements at TARDISCon",
        "author_id": "",
        "article_id": "sample_tardis_improvements_obrien",
        "display": true,
        "date": "2024-07-19",
        "category": "News",
        "tags": [
            "TARDISCon",
            "TARDIS",
            "news",
            "supernova"
        ],
        "platforms": [
            "tardis"
        ],
        "short_description": "At TARDISCon, we developed two new sampling methods for different scenarios:- the decay of positronium and the emission of packets from the photosphere.",
        "cover_image_height": "520px",
        "cover_image_width": "330px",
        "cover_image": "../articles/samplers_compare.gif",
        "content": {
            "1_para": "At TARDISCon, part of the TARDIS team ([anirban_dutta], [jing_lu], and [jack_o_brien]) worked on a new positronium spectrum sampler. Positronium is a bound system of an electron and a positron that is stable for only a very short time (nanoseconds). It has a chance to be formed as part of the beta decay process of radioactive elements in supernovae. When the electron-positron pair annihilate each other, they can produce either 2 or 3 gamma-rays. We wrote code to sample the possible gamma-ray energies by inverting the integral description from Ore & Powell (1949).",
            "2_para": "This sampler will be used as part of the gamma-ray energy deposition module for TARDIS that is currently under development. It will enable TARDIS to accurately simulate the formation and annihilation of positronium and the resulting gamma-ray spectra and deposition rates.",
            "3_para": "In addition to adding samplers for new physics processes, TARDIS team members added new sampling features to the existing radiative transfer framework.  [jack_o_brien], [anirban_dutta], and [wolfgang_kerzendorf] wrote a weighted sampler implementation for the Monte Carlo packet instantiation.  This new sampler allows TARDIS to draw more packet samples in wavelength regions with low radiative intensity to improve the quality of the statistics, especially near the red and blue ends of the spectrum.  In contrast to the original packet sampler, which generates packets at each frequency with a probability corresponding to its initial radiative intensity, the weighted sampler works by drawing frequencies for each packet uniformly across the spectrum and assigning a weight to each packet based on the initial radiative intensity.  In the future, this sampler will serve to help TARDIS both track and actively improve its sampling efficiency in undersampled regions of the spectrum as well as serve as a base for more complex importance samplers."
        },
        "people_involved_ids": [
            "Andrew Fullard",
            "",
            "Anirban  Dutta",
            "Wolfgang Kerzendorf"
        ],
        "links": {},
        "twitter": "None"
    },
    {
        "title": "Introducing a new logger widget for TARDIS!",
        "author_id": "",
        "article_id": "logger_widget_2024",
        "display": true,
        "date": "2024-07-19",
        "category": "News",
        "tags": [
            "logging",
            "simulation"
        ],
        "platforms": [
            "tardis"
        ],
        "short_description": "Detailed logger for TARDIS simulation run",
        "cover_image_height": "520px",
        "cover_image_width": "330px",
        "cover_image": "../articles/logger.gif",
        "content": {
            "1_para": "During TARDIS Con 2024, a collaborative effort by [deeksha_mohanty], [jaladh_singhal], [jing_lu], and [anirban_dutta] led to the development of a logging widget for TARDIS simulation runs. This widget organizes logging information into four tabs with the categories: warnings and errors, detailed simulation run information (including convergence and iteration details), debugging logs, and a comprehensive tab that consolidates all logs in the order they occur.",
            "2_para": "The new logging widget enhances the user experience by providing a clear overview of the simulation's performance and potential issues."
        },
        "people_involved_ids": [
            "Jaladh Singhal",
            "Jing Lu",
            "Anirban  Dutta"
        ],
        "links": {},
        "twitter": "None"
    },
    {
        "title": "TARDIS-con",
        "author_id": "Josh Shields",
        "article_id": "tardis_con24",
        "display": true,
        "date": "2024-07-19",
        "category": "News",
        "tags": [
            "news"
        ],
        "platforms": [
            "tardis"
        ],
        "short_description": "TARDIS-Con 2024 has come and gone. After another unique two-week un-conference, we are exhausted but very proud of the many projects that we worked on.",
        "cover_image": "../articles/TARDIScon24-Plasma-Session.jpg",
        "content": {
            "1_para": "TARDIS-Con 2024 has come and gone. After another unique two-week un-conference, we are exhausted but very proud of the many projects that we worked on. ",
            "2_img": "../articles/TARDIScon24-Plasma-triangle.png",
            "3_para": "On the TARDIS side, we worked on improving the code's efficiency, implementing new features, and discussing the latest scientific insights related to supernovae.",
            "4_para": "Our insights into Science of Science grew rapidly. We looked at how international collaborations become more prevalent in the last decades. ",
            "5_para": "We also enjoyed some group outings, including a day trip to Ann Arbor for a local craft market and a detour through an escape room.",
            "6_img": "../articles/TARDIScon24-Group-outing.png",
            "7_para": "See you next year at TARDIS-Con 2025!"
        },
        "people_involved_ids": [
            "Josh Shields",
            "Jing Lu",
            "Anirban  Dutta",
            "Wolfgang Kerzendorf",
            "Vicente  Amado Olivo",
            "Jaladh Singhal",
            "",
            "",
            "Andrew Fullard",
            "Bea Lu",
            "Jack O'Brien",
            "",
            ""
        ],
        "links": {},
        "twitter": "None"
    },
    {
        "title": "Attention! Update your TARDIS Python environment",
        "author_id": "Abhinav Ohri",
        "article_id": "update_python_env_2024",
        "display": true,
        "date": "2024-06-10",
        "category": "News",
        "tags": [
            "updates",
            "news",
            "dependencies"
        ],
        "platforms": [
            "tardis"
        ],
        "short_description": "We've updated our Python environment with the latest dependencies. Please update your environment to stay in sync and ensure optimal performance.",
        "cover_image": "../articles/lock_file_update_2024.jpeg",
        "content": {
            "1_para": "We upgrade the TARDIS environment with the current version of the scientific python software stack. This is to ensure that we include the latest bug fixes in our dependencies and have access to new API and tools.  We have updated our Python environment with the latest dependencies and the current lock-file is available here. Please read here how to <a href='https://tardis-sn.github.io/tardis/installation.html#environment-update'>update</a> the new environment."
        },
        "people_involved_ids": [
            ""
        ],
        "links": {},
        "twitter": "None"
    },
    {
        "title": "GSoC Students Begin Projects to Enhance TARDIS",
        "author_id": "Atharva Arya",
        "article_id": "gsoc_students_2024_begin",
        "display": true,
        "date": "2024-05-27",
        "category": "News",
        "tags": [
            "news"
        ],
        "platforms": [
            "tardis"
        ],
        "short_description": "We are thrilled to announce that our Google Summer of Code (GSoC) students, Sumit Gupta, Ashish Kumar, and Sarthak Srivastava, have officially started their projects! The projects will improve TARDIS performance, add tools for better analysis of the simulation and code to improve its science capabilities.",
        "cover_image": "../articles/gsoc_plus_tardis.png",
        "content": {
            "1_para": "We are thrilled to announce that our Google Summer of Code (GSoC) students, Sumit Gupta, Ashish Kumar, and Sarthak Srivastava, have officially started their projects! The projects will improve TARDIS performance, add tools for better analysis of the simulation and code to improve its science capabilities."
        },
        "people_involved_ids": [],
        "links": {},
        "twitter": "None"
    },
    {
        "title": "A Dr. is Born - Josh Shields Defends Thesis on SN Ia Surviving Companions",
        "author_id": "Josh Shields",
        "article_id": "thesis_defense_josh",
        "display": true,
        "date": "2024-05-03",
        "category": "News",
        "tags": [
            "PhD",
            "Astrophysics",
            "talk"
        ],
        "platforms": [
            "tardis",
            "kg"
        ],
        "short_description": "We are pleased to announce that Josh has just defended his thesis at Michigan State University investigating the progenitors of Type Ia Supernovae through the study of their surviving companions.",
        "cover_image_height": "520px",
        "cover_image_width": "330px",
        "cover_image": "../articles/josh_defense_title_slide.jpg",
        "content": {
            "1_para": "On May 3rd of 2024, [josh_shields] successfully defended his thesis invesitgating the surviving companions of Type Ia Supernovae. He joined our group in 2019 and quickly became an expert in stellar modeling and radiative transfer. In his first project he investigated the SN 1006 remnant for hypervelocity white dwarfs, interesting peculiar stars that could might result from SN Ia. In his second project, he investigated the SNR 0509-67.5 remnant in the Large Magellanic Cloud, testing a large collection of SN Ia progenitor scenarios by modelling the spectral energy distributions of all the stars inside the remnant. He then developed the STARDIS code, an adaptation of TARDIS, able to model stellar atmospheres and produce spectra of surviving companions. He will continue working with us, improving the functionality of TARDIS. He is an integral part of our group, and we are ecstatic to see what he does next.",
            "2_img": "../articles/josh_defense_group_photo.jpg"
        },
        "people_involved_ids": [
            "Josh Shields"
        ],
        "links": {},
        "twitter": "None"
    },
    {
        "title": "Dr. Jack O'Brien Successfully Defends Thesis on Supernova Progenitor Identification",
        "author_id": "Jack O'Brien",
        "article_id": "thesis_defence_jack",
        "display": true,
        "date": "2024-04-20",
        "category": "News",
        "tags": [
            "PhD",
            "Astrophysics",
            "talk"
        ],
        "platforms": [
            "tardis",
            "kg"
        ],
        "short_description": "We congratulate Dr. Jack O’Brien for successfully defending his thesis titled “Progenitor Identification of Type Ia Supernovae through Statistical Abundance Tomography from Optical Spectra with Machine Learning and Radiative Transfer” in astrophysics at Michigan State University.",
        "cover_image": "../articles/jackDefence.jpg",
        "content": {
            "1_para": "We congratulate Dr. [jack_o_brien] for successfully defending his thesis titled “Progenitor Identification of Type Ia Supernovae through Statistical Abundance Tomography from Optical Spectra with Machine Learning and Radiative Transfer” in astrophysics at Michigan State University. Jack started with us in 2020 and scientifically worked on (in addition to his thesis work) adding continuum opacities to TARDIS. He became and still is our education coordinator and made sure that students from different disciplines received training in physics, computing, and machine learning. He will join <a href='https://gnarayan.github.io/'>Gautham Narayan's group</a> at University of Illinois, Urbana-Champaign in the Fall of 2024. Thank you for all of your contributions and help and for being a fantastic team member!"
        },
        "people_involved_ids": [
            "Jack O'Brien"
        ],
        "links": {
            "Gautham Narayan group": "https://gnarayan.github.io/"
        },
        "twitter": "None"
    },
    {
        "title": "Accepted as a mentoring organisation for Google Summer of Code 2024",
        "author_id": "Atharva Arya",
        "article_id": "gsoc_2024_news",
        "display": true,
        "date": "2024-03-29",
        "category": "News",
        "tags": [
            "news"
        ],
        "platforms": [
            "tardis"
        ],
        "short_description": "We are a part of Google Summer of Code 2024.",
        "cover_image": "../articles/gsoc-logo-2024.png",
        "content": {
            "1_para": "We are excited to announce that TARDIS has been accepted as a mentoring organization in Google Summer of Code 2024! Check out our <a href='https://tardis-sn.github.io/summer_of_code/ideas/'>ideas page</a> and connect with us on <a href='https://gitter.im/tardis-sn/gsoc'>gitter</a> if you are interested! Please note that application deadline is April 2nd, 2024"
        },
        "people_involved_ids": [],
        "links": {
            "Our Gitter": "https://gitter.im/tardis-sn/gsoc",
            "GSoC Ideas": "https://tardis-sn.github.io/summer_of_code/ideas/"
        },
        "twitter": "None"
    }
]