[
    {
        "title": "A Dr. is Born - Josh Shields Defends Thesis on SN Ia Surviving Companions",
        "author_id": "Josh Shields",
        "article_id": "thesis_defense_josh",
        "display": true,
        "date": "03th May, 2024",
        "category": "News",
        "tags": [
            "news",
            "defense",
            "supernova",
            "Internship"
        ],
        "platforms": [
            "tardis",
            "kg"
        ],
        "short_description": "We are pleased to announce that Josh has just defended his thesis at Michigan State University investigating the progenitors of Type Ia Supernovae through the study of their surviving companions. Josh performed multiple surviving companion investigations in supernova remnants, and adapted TARDIS to be able to model stellar atmospheres and produce surviving companion spectra. He will continue to work with us expanding the plasma physics of TARDIS. ",
        "long_description": "",
        "cover_image_height": "520px",
        "cover_image_width": "330px",
        "cover_image": "../articles/josh_defense_title_slide.jpg",
        "content": {
            "1_para": "On May 3rd of 2024, Joshua Shields successfully defended his thesis invesitgating the surviving companions of Type Ia Supernovae. He joined our group in 2019 and quickly became an expert in stellar modeling and radiative transfer. In his first project he investigated the SN 1006 remnant for hypervelocity white dwarfs, interesting peculiar stars that could might result from SN Ia. In his second project, he investigated the SNR 0509-67.5 remnant in the Large Magellanic Cloud, testing a large collection of SN Ia progenitor scenarios by modelling the spectral energy distributions of all the stars inside the remnant. He then developed the STARDIS code, an adaptation of TARDIS, able to model stellar atmospheres and produce spectra of surviving companions. He will continue working with us, improving the functionality of TARDIS. He is an integral part of our group, and we are ecstatic to see what he does next.",
            "2_img": "../articles/josh_defense_group_photo.jpg"
        },
        "people_involved_ids": [
            "Josh Shields"
        ],
        "links": {},
        "twitter": "None"
    },
    {
        "title": "Dr. Jack O'Brien Successfully Defends Thesis on Supernova Progenitor Identification",
        "author_id": "Jack O'Brien",
        "article_id": "thesis_defence_jack",
        "display": true,
        "date": "20th Apr, 2024",
        "category": "News",
        "tags": [
            "news",
            "Internship"
        ],
        "platforms": [
            "tardis",
            "kg"
        ],
        "short_description": "We congratulate Dr. Jack O’Brien for successfully defending his thesis titled “Progenitor Identification of Type Ia Supernovae through Statistical Abundance Tomography from Optical Spectra with Machine Learning and Radiative Transfer” in astrophysics at Michigan State University. Jack started with us in 2020 and scientifically worked on (in addition to his thesis work) adding continuum opacities to TARDIS. He became and still is our education coordinator and made sure that students from different disciplines received training in physics, computing, and machine learning. He will join Gautham Narayan’s group at University of Illinois, Urbana-Champaign in the Fall of 2024. Thank you for all of your contributions and help and for being a fantastic team member!",
        "long_description": "",
        "cover_image": "../articles/jackDefence.jpg",
        "content": {
            "1_para": "We congratulate Dr. Jack O’Brien for successfully defending his thesis titled “Progenitor Identification of Type Ia Supernovae through Statistical Abundance Tomography from Optical Spectra with Machine Learning and Radiative Transfer” in astrophysics at Michigan State University. Jack started with us in 2020 and scientifically worked on (in addition to his thesis work) adding continuum opacities to TARDIS. He became and still is our education coordinator and made sure that students from different disciplines received training in physics, computing, and machine learning. He will join <a href='https://gnarayan.github.io/'>Gautham Narayan's group</a> at University of Illinois, Urbana-Champaign in the Fall of 2024. Thank you for all of your contributions and help and for being a fantastic team member!"
        },
        "people_involved_ids": [
            "Jack O'Brien"
        ],
        "links": {
            "Gautham Narayan group": "https://gnarayan.github.io/"
        },
        "twitter": "None"
    },
    {
        "title": "Accepted as a mentoring organisation for Google Summer of Code 2024",
        "author_id": "Atharva Arya",
        "article_id": "gsoc_2024_news",
        "display": true,
        "date": "29th Mar, 2024",
        "category": "News",
        "tags": [
            "news"
        ],
        "platforms": [
            "tardis"
        ],
        "short_description": "We are a part of Google Summer of Code 2024.",
        "long_description": "",
        "cover_image": "../articles/gsoc-logo-2024.png",
        "content": {
            "1_para": "We are excited to announce that TARDIS has been accepted as a mentoring organization in Google Summer of Code 2024! Check out our <a href='https://tardis-sn.github.io/summer_of_code/ideas/'>ideas page</a> and connect with us on <a href='https://gitter.im/tardis-sn/gsoc'>gitter</a> if you are interested! Please note that application deadline is April 2nd, 2024"
        },
        "people_involved_ids": [],
        "links": {
            "Our Gitter": "https://gitter.im/tardis-sn/gsoc",
            "GSoC Ideas": "https://tardis-sn.github.io/summer_of_code/ideas/"
        },
        "twitter": "None"
    }
]